; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v13 ?v8)
             (pred_6 ?v1 ?v5)
             (pred_5 ?v13 ?v5)
             (pred_9 ?v4 ?v13 )
	     (pred_2 ?v13)
             (pred_12 ?v3)
             (pred_1 ?v1)
             (pred_3 ?v5)
             (pred_7 ?v13)
             (pred_10 ?v1)
             (pred_4 ?v13)
             (pred_11 ))



(:action op_1
:parameters (?v6 ?v2 ?v12 ?v11)
:precondition (and (pred_12 ?v6) (pred_12 ?v2) (pred_1 ?v12) (pred_3 ?v11)
          (pred_8 ?v6 ?v2) (pred_6 ?v12 ?v11)
                   (pred_5 ?v2 ?v11) (pred_2 ?v6) 
                   (pred_7 ?v2) (pred_10 ?v12))
:effect (and  (pred_4 ?v2) (not (pred_7 ?v2))))


(:action op_5
:parameters (?v6 ?v7)
:precondition (and (pred_12 ?v6) (pred_12 ?v7)
               (pred_2 ?v6) (pred_8 ?v6 ?v7) (pred_4 ?v7))
:effect (and (pred_2 ?v7) (not (pred_2 ?v6))))

(:action op_3
:parameters (?v6 ?v12)
:precondition (and (pred_12 ?v6) (pred_1 ?v12) 
                  (pred_2 ?v6) (pred_9 ?v12 ?v6) (pred_11 ))
:effect (and (pred_10 ?v12)
   (not (pred_9 ?v12 ?v6)) (not (pred_11 ))))


(:action op_2
:parameters (?v6 ?v10 ?v9)
:precondition (and (pred_12 ?v6) (pred_1 ?v10) (pred_1 ?v9)
                  (pred_2 ?v6) (pred_10 ?v9) (pred_9 ?v10 ?v6))
:effect (and (pred_10 ?v10) (pred_9 ?v9 ?v6)
        (not (pred_10 ?v9)) (not (pred_9 ?v10 ?v6))))

(:action op_4
:parameters (?v6 ?v12)
:precondition (and (pred_12 ?v6) (pred_1 ?v12) 
                  (pred_2 ?v6) (pred_10 ?v12))
:effect (and (pred_11 ) (pred_9 ?v12 ?v6) (not (pred_10 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_01 obj_09 obj_06 obj_08 obj_15 obj_14 obj_16 obj_04 obj_17 obj_18 obj_10 obj_07 obj_02 obj_05 obj_19
    obj_20 obj_03
    obj_12 obj_13
    )

    (:init
       (pred_11)

       (pred_12 obj_11)
       (pred_12 obj_01)
       (pred_12 obj_09)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_15)
       (pred_12 obj_14)
       (pred_12 obj_16)
       (pred_12 obj_04)
       (pred_12 obj_17)
       (pred_12 obj_18)
       (pred_12 obj_10)
       (pred_12 obj_07)
       (pred_12 obj_02)
       (pred_12 obj_05)
       (pred_12 obj_19)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_1 obj_12)
       (pred_1 obj_13)

       (pred_8 obj_11 obj_08)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_01 obj_15)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_09 obj_06)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_06 obj_09)
       (pred_8 obj_08 obj_04)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_11)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_15 obj_01)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_14 obj_16)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_14 obj_15)
       (pred_8 obj_16 obj_10)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_16 obj_14)
       (pred_8 obj_04 obj_07)
       (pred_8 obj_04 obj_17)
       (pred_8 obj_04 obj_08)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_18)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_17 obj_04)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_17)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_16)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_07 obj_02)
       (pred_8 obj_07 obj_04)
       (pred_8 obj_02 obj_05)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_02 obj_07)
       (pred_8 obj_05 obj_19)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_05 obj_02)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_05)
       (pred_7 obj_06)
       (pred_7 obj_19)
       (pred_5  obj_06 obj_20)
       (pred_5  obj_19 obj_03)
       (pred_4 obj_11)
       (pred_4 obj_01)
       (pred_4 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_15)
       (pred_4 obj_14)
       (pred_4 obj_16)
       (pred_4 obj_04)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_05)

       (pred_6  obj_12 obj_20)
       (pred_6  obj_13 obj_03)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_13 obj_09)
       (pred_2 obj_14)
    )

    (:goal (and
       (pred_9 obj_13 obj_15)
    ))
(:constraints
  (always (not (pred_2 obj_01)))
)
)

; plan
1. (op_5 obj_14 obj_09)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_09)
   goals met: 0 of 1
2. (op_3 obj_09 obj_13)
   deleted: (pred_9 obj_13 obj_09) (pred_11)
   added: (pred_10 obj_13)
   goals met: 0 of 1
3. (op_5 obj_09 obj_14)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_14)
   goals met: 0 of 1
4. (op_5 obj_14 obj_15)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_15)
   goals met: 0 of 1
5. (op_4 obj_15 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_11) (pred_9 obj_13 obj_15)
   goals met: 1 of 1
